Repository: rmraya/OpenXLIFF
Catalog: OpenXLIFF_es.tmx
Source language: en
Languages: es

source: Usage: {0} [-help] [-version] -file sourceFile -srcLang sourceLang [-tgtLang targetLang] [-skl skeletonFile] [-xliff xliffFile] [-type fileType] [-enc encoding] [-srx srxFile] [-catalog catalogFile] [-divatal ditaval] [-config configFile] [-embed] [-paragraph] [-xmlfilter folder][-2.0] [-ignoretc][-charsets] Where: -help: (optional) display this help information and exit -version: (optional) display version & build information and exit -file: source file to convert -srcLang: source language code -tgtLang: (optional) target language code -xliff: (optional) XLIFF file to generate -skl: (optional) skeleton file to generate -type: (optional) document type -enc: (optional) character set code for the source file -srx: (optional) SRX file to use for segmentation -catalog: (optional) XML catalog to use for processing -ditaval: (optional) conditional processing file to use when converting DITA maps -config: (optional) configuration file to use when converting JSON documents -embed: (optional) store skeleton inside the XLIFF file -paragraph: (optional) use paragraph segmentation -xmlfilter: (optional) folder containing configuration files for the XML filter -ignoretc: (optional) ignore tracked changes from Oxygen XML Editor in XML files -2.0: (optional) generate XLIFF 2.0 -charsets: (optional) display a list of available character sets and exit Document Types INX = Adobe InDesign Interchange ICML = Adobe InCopy ICML IDML = Adobe InDesign IDML DITA = DITA Map HTML = HTML Page JS = JavaScript JSON = JSON JAVA = Java Properties MIF = MIF (Maker Interchange Format) OFF = Microsoft Office 2007 Document OO = OpenOffice Document PHPA = PHP Array PO = PO (Portable Objects) RC = RC (Windows C/C++ Resources) RESX = ResX (Windows .NET Resources) SDLPPX = Trados Studio Package SDLXLIFF = SDLXLIFF Document SRT = SRT Subtitle TEXT = Plain Text TS = TS (Qt Linguist translation source) TXLF = Wordfast/GlobalLink XLIFF TXML = TXML Document WPML = WPML XLIFF XLIFF = XLIFF Document XML = XML Document XMLG = XML (Generic)
es: Uso: {0} [-help] [-version] -file archivo -srcLang idiomaOrigen [-tgtLang idiomaDestino] [-skl esqueleto] [-xliff archivoXliff] [-type tipoArchivo] [-enc codificación] [-srx archivoSrx] [-catalog catalogoXml] [-divatal ditaval] [-config configuración] [-embed] [-paragraph] [-xmlfilter filtros] [-2.0] [-ignoretc] [-charsets] Dónde: -help: (opcional) mostrar esta información de ayuda y salir -versión: (opcional) mostrar información de versión y salir -file: archivo fuente para convertir -srcLang: código de idioma origen del idioma -tgtLang: código de idioma de destino (opcional) -xliff: (opcional) archivo XLIFF para generar -skl: (opcional) archivo esqueleto a generar -type: (opcional) tipo de documento -enc: código de juego de caracteres (opcional) para el archivo fuente -srx: (opcional) archivo SRX para usar para la segmentación -catalog: (opcional) Catálogo XML para el procesamiento -ditaval: archivo de procesamiento condicional (opcional) para usar al convertir mapas DITA -config: archivo de configuración (opcional) para usar al convertir documentos JSON -embed: (opcional) almacenar esqueleto dentro del archivo XLIFF -paragraph: (opcional) use segmentación de párrafos -xmlfilter: carpeta (opcional) que contiene archivos de configuración para el filtro XML -ignoretc: (opcional) ignorar los cambios controlados de Oxygen XML Editor en archivos XML -2.0: (opcional) generar XLIFF 2.0 -charsets: (opcional) mostrar una lista de juegos de caracteres disponibles y salir Tipos de documentos INX = Adobe InDesign Interchange ICML = Adobe InCopy ICML IDML = Adobe InDesign IDML DITA = Mapa DITA HTML = Página HTML JS = JavaScript JSON = JSON JAVA = Propiedades de Java MIF = MIF (Maker Interchange Format) OFF = Documento de Microsoft Office 2007 OO = Documento de OpenOffice PHPA = PHP Array PO = PO (Portable Objects) RC = RC (recursos de Windows C/C++) RESX = ResX (recursos de Windows .NET) SDLPPX = Paquete Trados Studio SDLXLIFF = Documento SDLXLIFF SRT = Subtítulo SRT TEXTO = Texto sin formato TS = TS (archivo de traducción de Qt Linguist) TXLF = Wordfast/GlobalLink XLIFF TXML = Documento TXML WPML = WPML XLIFF XLIFF = Documento XLIFF XML = Documento XML XMLG = XML (genérico)

source: Invalid 'type' attribute in <pc>
es: Atributo 'type' no válido en <pc>

source: Missing 'type' attribute in <pc> that has 'subType'
es: Falta el atributo 'type' en <pc> que tiene 'subType'

source: Invalid 'subType' attribute value: ''{0}'' in <pc>
es: Valor de atributo 'subType' no válido: ''{0}'' en <pc>

source: Invalid 'subType' attribute value for type='ui' in <pc>
es: Valor de atributo 'subType' no válido para type='ui' en <pc>

source: Invalid 'subType' attribute value for type='fmt' in <pc>
es: Valor de atributo 'subType' no válido para type='fmt' en <pc>

source: Duplicated 'id' in <sc/>
es: 'id' duplicado en <sc/>

source: <sc> element with both 'copyOf' and 'dataRef'
es: Elemento <sc> con 'copyOf' y 'dataRef'

source: Missing <data> element referenced by <sc>
es: Falta el elemento <data> al que se refiere <sc>

source: Version: {0} Build: {1}
es: Versión: {0} Compilación: {1}

source: Invalid 'type' attribute in <sc>
es: Atributo 'type' no válido en <sc>

source: Missing 'type' attribute in <sc> that has 'subType'
es: Falta el atributo 'type' en <sc> que tiene 'subType'

source: Invalid 'subType' attribute value: ''{0}'' in <sc>
es: Valor de atributo 'subType' no válido: ''{0}'' en <sc>

source: Invalid 'subType' attribute value for type='ui' in <sc>
es: Valor de atributo 'subType' no válido para type='ui' en <sc>

source: Invalid 'subType' attribute value for type='fmt' in <sc>
es: Valor de atributo 'subType' no válido para type='fmt' en <sc>

source: Missing 'id' attribute in <ec/>
es: Falta el atributo 'id' en <ec/>

source: Duplicated 'id' in <ec/>
es: 'id' duplicado en <ec/>

source: Missing 'startRef' attribute in <ec/>
es: Falta el atributo 'startRef' en <ec/>

source: Missing <sc/> element with id=''{0}'' referenced by <ec/>
es: Falta el elemento <sc/> con id=''{0}'' referenciado por <ec>

source: Different 'canCopy' attribute in <sc/> with id=''{0}'' and matching <ec/>
es: Diferente atributo 'canCopy' en <sc/> con id = ''{0}'' y correspondiente <ec/>

source: Different 'canDelete' attribute in <sc/> with id=''{0}'' and matching <ec/>
es: Diferente atributo 'canDelete' en <sc/> con id = ''{0}'' y correspondiente <ec/>

source: Different 'canOverlap' attribute in <sc/> with id=''{0}'' and matching <ec/>
es: Diferente atributo 'canOverlap' en <sc/> con id = ''{0}'' y correspondiente <ec/>

source: Different 'canReorder' attribute in <sc/> with id=''{0}'' and matching <ec/>
es: Diferente atributo 'canReorder' en <sc/> con id = ''{0}'' y correspondiente <ec/>

source: <ec> element with both 'copyOf' and 'dataRef'
es: Elemento <ec> con 'copyOf' y 'dataRef'

source: Missing <data> element referenced by <ec> in <mtc:match>
es: Falta el elemento <data> al que se refiere <ec> en <mtc:match>

source: Missing <data> element referenced by <ec>
es: Falta el elemento <data> al que se refiere <ec>

source: Invalid 'type' attribute in <ec>
es: Atributo 'type' no válido en <ec>

source: Missing 'type' attribute in <ec> that has 'subType'
es: Falta el atributo 'type' en <ec> que tiene 'subType'

source: Source file does not exist
es: El archivo fuente no existe

source: Invalid 'subType' attribute value: ''{0}'' in <ec>
es: Valor de atributo 'subType' no válido: ''{0}'' en <ec>

source: Invalid 'subType' attribute value for type='ui' in <ec>
es: Valor de atributo 'subType' no válido para type='ui' en <ec>

source: Invalid 'subType' attribute value for type='fmt' in <ec>
es: Valor de atributo 'subType' no válido para type='fmt' en <ec>

source: Duplicated 'id' in <mrk/>
es: 'id' duplicado en <mrk/>

source: Missing 'ref' in comment annotation
es: Falta el atributo 'ref' en anotación de comentario

source: Invalid fragment identifier ''{0}'' in comment annotation
es: Identificador de fragmento ''{0}'' no válido en anotación de comentario

source: Missing <note> referenced in comment annotation
es: Falta el elemento <note> referenciado en anotación de comentario

source: Comment annotation contains both 'value' and 'ref'
es: Anotación de comentario contiene tanto 'value' como 'ref'

source: Duplicated 'id' in <sm/>
es: 'id' duplicado en <sm/>

source: Auto-detected type: {0}
es: Tipo detectado automáticamente: {0}

source: Missing <sm> with id=''{0}'' referenced by <em>
es: Falta el elemento <sm> con id=''{0}'' referenciado por <em>

source: Attribute ''{0}:subFs' without corresponding ''{1}:fs'
es: Atributo ''{0}:subFs' sin el correspondiente ''{1}:fs'

source: <sc> element without matching <ec> in <source>
es: Elemento <sc> sin correspondiente <ec> en <source>

source: <sc> element without matching <ec> in <target>
es: Elemento <sc> sin correspondiente <ec> en <target>

source: Inline element with 'canDelete' set to 'no' is missing in <target>
es: Falta elemento en línea con 'canDelete' establecido en 'no' en <target>

source: <ph> element with different value of 'canCopy' in <source> and <target>
es: Elemento <ph> con diferente valor de 'canCopy' en <source> y <target>

source: <ph> element with different value of 'canDelete' in <source> and <target>
es: Elemento <ph> con diferente valor de 'canDelete' en <source> y <target>

source: <ph> element with different value of 'canReorder' in <source> and <target>
es: Elemento <ph> con diferente valor de 'canReorder' en <source> y <target>

source: <ph> element with different value of 'copyOf' in <source> and <target>
es: Elemento <p> con diferente valor de 'copyOf' en <source> y <target>

source: <ph> element with different value of 'dataRef' in <source> and <target>
es: Elemento <ph> con diferente valor de 'dataRef' en <source> y <target>

source: Unable to auto-detect file format. Use '-type' parameter.
es: No se puede detectar automáticamente el formato de archivo. Utilice el parámetro '-type'.

source: <ph> element with different value of 'subFlows' in <source> and <target>
es: Elemento <ph> con diferente valor de 'subFlows' en <source> y <target>

source: <ph> element with different value of 'type' in <source> and <target>
es: Elemento <ph> con diferente valor de 'type' en <source> y <target>

source: Usage: {0} [-help] -file xliffFile [-catalog catalogFile] Where: -help: (optional) Display this help information and exit -file: XLIFF file to validate -catalog: (optional) XML catalog to use for processing
es: Uso: {0} [-help] -xliff archivoXliff [-catalog catalogoXml] Dónde: -help: (opcional) Mostrar esta información de ayuda y salir -xliff: archivo XLIFF a validar -catalog: (opcional) Catálogo XML para el procesamiento

source: Invalid XLIFF version
es: Versión de XLIFF no válida

source: Invalid attribute in <{0}>: {1}
es: Atributo no válido en <{0}>: {1}

source: Invalid date: {0}
es: Fecha no válida: {0}

source: Invalid URI: {0}
es: URI no válida: {0}

source: Invalid language: {0}
es: Idioma no válido: {0}

source: Unknown file format
es: Formato de archivo desconocido

source: Invalid source language: {0}
es: Idioma de origen no válido: {0}

source: Invalid target language: {0}
es: Idioma de destino no válido: {0}

source: Duplicated "name" in <phase>: {0}
es: 'name' duplicado en <phase>: {0}

source: Duplicated "tool-id" in <tool>: {0}
es: 'tool-id' duplicado en <tool>: {0}

source: Incorrect segment referenced in <alt-trans> element
es: Segmento incorrecto referenciado en elemento <alt-trans>

source: Undeclared <tool> referenced in <alt-trans> element
es: Elemento <tool> sin declarar referenciado en <alt-trans>

source: Undeclared <phase> referenced in <alt-trans> element
es: Elemento <phase> sin declarar referenciado en <alt-trans>

source: Found <source> with wrong language code: {0}
es: Se encontró <source> con un código de idioma incorrecto: {0}

source: Found <target> with wrong language code: {0}
es: Se encontró <target> con un código de idioma incorrecto: {0}

source: Auto-detected encoding: {0}
es: Codificación detectada automáticamente: {0}

source: Duplicated "id" in <trans-unit>: {0}
es: 'id' duplicado en <trans-unit>: {0}

source: Duplicated "mid" in <mrk>: {0}
es: 'mid' duplicado en <mrk>: {0}

source: Incorrect segment referenced in <target> element
es: Segmento incorrecto referenciado en elemento <target>

source: Duplicated "id" in <group>: {0}
es: 'id' duplicado en <group>: {0}

source: Found duplicated <it> element
es: Se encontró un elemento <it> duplicado

source: Found <bx> without "rid" or "id" attributes
es: Se encontró elemento <bx> sin attributos "rid" o "id"

source: Unable to auto-detect character set. Use '-enc' parameter.
es: No se puede detectar automáticamente el juego de caracteres. Utilice el parámetro '-enc'.

source: Found <ex> without "rid" or "id" attributes
es: Se encontró elemento <ex> sin attributos "rid" o "id"

source: Found <bpt> without "rid" or "id" attributes
es: Se encontró elemento <bpt> sin attributos "rid" o "id"

source: Found <ept> without "rid" or "id" attributes
es: Se encontró elemento <ept> sin attributos "rid" o "id"

source: Unmatched <ex>/<bx> in <{0}>
es: <ex>/<bx> sin aparear en <{0}>

source: Unmatched <bpt>/<ept> in <{0}>
es: <bpt>/<ept> sin aparear en <{0}>

source: Unmatched <it> in <file>
es: <it> sin aparear en <file>

source: Invalid XLIFF. Reason: {0}
es: XLIFF no válido. Motivo: {0}

source: Incorrect segment referenced in "xid" attribute
es: Segmento incorrecto referenciado en atributo "xid"

source: File is valid XLIFF {0}
es: El archivo es XLIFF {0} válido

source: Error creating validator
es: Error al crear validador

source: Unsupported encoding
es: Codificación no admitida

source: Missing version attribute
es: Falta el atributo de versión

source: XLIFF {0} not supported yet
es: XLIFF {0} aún no es compatible

source: Missing '-srcLang' parameter
es: Falta el parámetro '-srcLang'

source: ''{0}'' is not a valid language code
es: ''{0}'' no es un código de idioma válido

source: Error validating languages
es: Error al validar idiomas

source: Error generating XLIFF 2.0
es: Error al generar XLIFF 2.0

source: SRX file does not exist
es: El archivo SRX no existe

source: Conversion error: {0}
es: Error de conversión: {0}

source: Error adding skeleton
es: Error al agregar esqueleto

source: <sub> elements are not supported
es: Los elementos <sub> no son admitidos

source: Missing target language declaration
es: Falta la declaración del idioma destino

source: Error detecting XML encoding
es: Error al detectar la codificación de XML

source: Error detecting RC encoding
es: Error al detectar la codificación de RC

source: Error detecting HTML encoding
es: Error al detectar la codificación de HTML

source: Error detecting SRT encoding
es: Error al detectar la codificación de SRT

source: Error detecting PHPA encoding
es: Error al detectar la codificación de PHPA

source: Error detecting JSON encoding
es: Error al detectar la codificación de JSON

source: Selected file is not JSON
es: El archivo seleccionado no es JSON

source: Invalid <mrk> element: {0}
es: Elemento <mrk> no válido: {0}

source: Usage: {0} [-help] -target targetFile -files file1,file2,file3... Where: -help: (optional) Display this help information and exit -target: combined output XLIFF file -files: list of XLIFF files to join, separated by ','
es: Uso: {0} [-help] -target xliffCombinado -files archivo1,archivo2,archivo33... Dónde: -help: (opcional) Mostrar esta información de ayuda y salir -target: archivo XLIFF de salida combinada -files: lista de archivos XLIFF a unir, separados por ','

source: File ''{0}'' does not exist
es: El archivo ''{0}'' no existe

source: XLIFF files from different versions
es: Archivos XLIFF de diferentes versiones

source: XLIFF files with different source language
es: Archivos XLIFF con diferente idioma de origen

source: XLIFF files with different target language
es: Archivos XLIFF con diferente idioma de destino

source: Usage: {0} [-help] [-version] -xliff xliffFile -target targetFile [-catalog catalogFile] [-unapproved] [-export] Where: -help: (optional) display this help information and exit -version: (optional) display version & build information and exit -xliff: XLIFF file to merge -target: (optional) translated file or folder where to store translated files -catalog: (optional) XML catalog to use for processing -unapproved: (optional) accept translations from unapproved segments -export: (optional) generate TMX file from approved segments
es: Uso: {0} [-help] [-version] -xliff archivoXliff -target traducción [-catalog catalogoXml] [-unapproved] [-export] Dónde: -help: (opcional) mostrar esta información de ayuda y salir -versión: (opcional) mostrar información de versión y salir -xliff: archivo XLIFF para combinar -target: (opcional) archivo traducido o carpeta donde almacenar los archivos traducidos -catalog: (opcional) Catálogo XML para el procesamiento -unapproved: (opcional) aceptar traducciones de segmentos no aprobados -export: (opcional) generar archivo TMX a partir de segmentos aprobados

source: Missing '-xliff' parameter
es: Falta el parámetro '-xliff'

source: Error getting target file
es: Error al obtener el archivo de destino

source: Missing '-target' parameter
es: Falta el parámetro '-target'

source: Merge error: {0}
es: Error de combinación: {0}

source: ''{0}'' is not a directory
es: ''{0}'' no es un directorio

source: Unsupported XLIFF file
es: Archivo XLIFF no compatible

source: Error merging XLIFF
es: Error al combinar XLIFF

source: Selected file is not a valid XLIFF document
es: El archivo seleccionado no es un documento XLIFF válido

source: Bad request. Please check error message and your parameters.
es: Solicitud incorrecta. Verifique el mensaje de error y sus parámetros.

source: Usage: {0} [-help] -xliff xliffFile [-catalog catalogFile] Where: -help: (optional) Display this help information and exit -xliff: XLIFF file to pseudo-translate -catalog: (optional) XML catalog to use for processing
es: Uso: {0} [-help] -xliff archivoXliff [-catalog catalogoXml] Dónde: -help: (opcional) Mostrar esta información de ayuda y salir -xliff: archivo XLIFF para pseudo-traducir -catalog: (opcional) Catálogo XML para el procesamiento

source: Requested segment does not exist in skeleton file
es: El segmento solicitado no existe en el archivo esqueleto

source: Invalid path
es: Ruta no válida
